# Pandas

In [1]:
import pandas as pd

* Series --- 1d array
* Data Frame --- 2d array (data is in table format , row & col )

In [2]:
a = pd.Series([])
b = pd.Series([1,3,33,47,58,100])
c = pd.Series((45,89,20,30,44))
d = pd.Series({'a':10,'b':15,'c':56,'d':99})

C:\Users\dell\AppData\Local\Temp\ipykernel_13360\2855873241.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a = pd.Series([])

In [3]:
print(type(a))
print(type(b))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
a

Series([], dtype: float64)

In [5]:
b # here 0 1 2 3 4 5 is index and another is values

0      1
1      3
2     33
3     47
4     58
5    100
dtype: int64

In [6]:
c

0    45
1    89
2    20
3    30
4    44
dtype: int64

In [7]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [8]:
import numpy as np

In [9]:
n = np.array([1,2,3,4,40])

In [10]:
x = pd.Series(n)

In [11]:
x

0     1
1     2
2     3
3     4
4    40
dtype: int32

In [12]:
n

array([ 1,  2,  3,  4, 40])

In [13]:
type(x)

pandas.core.series.Series

In [14]:
b = pd.Series([1,3,[11,13],33,[12,26],47,58,100])

In [15]:
b

0           1
1           3
2    [11, 13]
3          33
4    [12, 26]
5          47
6          58
7         100
dtype: object

In [16]:
type(b)

pandas.core.series.Series

In [17]:
b[0]

1

In [18]:
b[4]

[12, 26]

In [19]:
b[4][0]

12

In [20]:
b[0:4]

0           1
1           3
2    [11, 13]
3          33
dtype: object

In [21]:
b[3:7]

3          33
4    [12, 26]
5          47
6          58
dtype: object

In [22]:
d = pd.Series({'a':10,'b':15,'c':56,'d':99})

In [23]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [24]:
d['b':'d'] # d['b':]

b    15
c    56
d    99
dtype: int64

In [25]:
s = pd.Series([12,52,42,10,23],index=['q','w','e','r','t'])

In [26]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [27]:
s = pd.Series([12,52,42,10,23],index=['q','w',4,1,'t'])

In [28]:
s

q    12
w    52
4    42
1    10
t    23
dtype: int64

In [31]:
s1 = pd.Series([12,52,42,10,23],index=['q','w','e','r','t'])

In [32]:
s1

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [37]:
s2 = pd.Series([12,52,42,10,52,23,10,12,23])

In [38]:
s2

0    12
1    52
2    42
3    10
4    52
5    23
6    10
7    12
8    23
dtype: int64

In [39]:
s2.value_counts()

12    2
52    2
10    2
23    2
42    1
dtype: int64

In [40]:
s2.argmax()

1

In [41]:
s2.argmin()

3

In [33]:
s1

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [34]:
s1.idxmax()

'w'

In [42]:
s2.idxmax()

1

In [36]:
s1.idxmin()

'r'

# Dataframe

In [43]:
a = pd.DataFrame()
b = pd.DataFrame([1,2,55,40,86])

In [44]:
a

Empty DataFrame
Columns: []
Index: []

In [45]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [46]:
type(b)

pandas.core.frame.DataFrame

In [47]:
c = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

In [48]:
c

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [49]:
d = pd.DataFrame([[1,2,3,70,67],[4,5,10,15,6],[7,8,9,10,11],[11,15,18,16,23],[10,20,30,40,50]])

In [50]:
d

    0   1   2   3   4
0   1   2   3  70  67
1   4   5  10  15   6
2   7   8   9  10  11
3  11  15  18  16  23
4  10  20  30  40  50

In [51]:
c11 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[84,58,39],[83,3,5],[47,5,78],[56,45,33],[23,45,23]])

In [52]:
c11

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  84  58  39
4  83   3   5
5  47   5  78
6  56  45  33
7  23  45  23

In [53]:
c11.tail() # last five  by defuault

    0   1   2
3  84  58  39
4  83   3   5
5  47   5  78
6  56  45  33
7  23  45  23

In [54]:
c11.head() # first five by default

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  84  58  39
4  83   3   5

In [55]:
c11.head(2)

   0  1  2
0  1  2  3
1  4  5  6

In [56]:
c11.sample() # randomly data

    0   1   2
3  84  58  39

In [57]:
c11.sample(5)

    0   1   2
2   7   8   9
4  83   3   5
1   4   5   6
0   1   2   3
7  23  45  23

In [58]:
x = pd.DataFrame([[1,2,],[4,9],[7,8,10]])

In [59]:
x

   0  1     2
0  1  2   NaN
1  4  9   NaN
2  7  8  10.0

In [60]:
x1 = pd.DataFrame([[1,2,],[np.nan,3,4],[34,np.nan,5]])

In [61]:
x1

      0    1    2
0   1.0  2.0  NaN
1   NaN  3.0  4.0
2  34.0  NaN  5.0

In [62]:
x2 = pd.DataFrame([[1,2,'missing'],[np.nan,3,4],[34,np.nan,5],[2,3,]])

In [63]:
x2

      0    1        2
0   1.0  2.0  missing
1   NaN  3.0        4
2  34.0  NaN        5
3   2.0  3.0     None

In [65]:
p = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index = ['a','b','c'])

In [66]:
p

   0  1  2
a  1  2  3
b  4  5  6
c  7  8  9

In [67]:
p1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns= ['a','b','c'])

In [68]:
p1

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [69]:
p1['b']

0    2
1    5
2    8
Name: b, dtype: int64

In [70]:
p1[['b','c']]

   b  c
0  2  3
1  5  6
2  8  9

In [71]:
c11

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  84  58  39
4  83   3   5
5  47   5  78
6  56  45  33
7  23  45  23

In [72]:
c11 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[84,58,39],[83,3,5],[47,5,78],[56,45,33],[23,45,23]],columns = ['a','b','c'])

In [73]:
c11[['a','b']].head()

    a   b
0   1   2
1   4   5
2   7   8
3  84  58
4  83   3

In [74]:
c11[['a','b']][1:4]

    a   b
1   4   5
2   7   8
3  84  58

In [75]:
c11.shape

(8, 3)

In [76]:
c11[['a']].max()

a    84
dtype: int64

In [77]:
c11[['a']].min()

a    1
dtype: int64

In [79]:
c11['new_col1'] = [2,3,4,56,6,3,4,3]

In [80]:
c11['new_col2'] = [3,5,2,4,6,3,5,5]

In [81]:
c11

    a   b   c  new_col1  new_col2
0   1   2   3         2         3
1   4   5   6         3         5
2   7   8   9         4         2
3  84  58  39        56         4
4  83   3   5         6         6
5  47   5  78         3         3
6  56  45  33         4         5
7  23  45  23         3         5

In [82]:
c11['e'] = c11['new_col1'] + c11['new_col2']

In [83]:
c11

    a   b   c  new_col1  new_col2   e
0   1   2   3         2         3   5
1   4   5   6         3         5   8
2   7   8   9         4         2   6
3  84  58  39        56         4  60
4  83   3   5         6         6  12
5  47   5  78         3         3   6
6  56  45  33         4         5   9
7  23  45  23         3         5   8

In [84]:
f = c11['e']>50

In [85]:
c11[f]

    a   b   c  new_col1  new_col2   e
3  84  58  39        56         4  60

In [89]:
g = c11['c']>50 # logical indexing

In [88]:
c11[g]

    a  b   c  new_col1  new_col2  e
5  47  5  78         3         3  6